Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
         ~ "timestamp" = "1758271880355897000" -> "1758530288070987000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:18",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7614815530871434611" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271880830152000" -> "1758530288066070000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:18",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8179981964626479171" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271879851851000" -> "1758530286934486000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:18",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7414118750309310367" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271880483373000" -> "1758530287743776000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:18",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7933646910123573093" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271880462578000" -> "1758530288042560200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:18",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3066268331273997862" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271881321863000" -> "1758530287842232000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:18",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2449301003709865756" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271881267736000" -> "1758530287554257000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:18",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "459674262939403403" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271880372136200" -> "1758530286934320000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:18",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "190088704213592476" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271880544203000" -> "1758530288536744200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:18",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7922816161598432994" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271881318316000" -> "1758530287564167000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:c299a63cd84b5175e22b6a45395d0e8e7a51257e055fca0115d981df1cbdc46e" -> (known after apply)
      ~ last_modified                  = "2025-09-19T08:54:24.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:18",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8361332985497117147" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271879863751000" -> "1758530287721803000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:18" -> (known after apply)
      ~ code_sha256                 = "7fpcHge6VDuU6CxcjZx8GyGvX3VafQHzqiMUT3p8RBw=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-19T16:52:35.484+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:18" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/d16313089a42de97c32c76d629ffa4488696b4f57998b2b7e4979ec576fa0165.zip" -> "builds/f42006c0774e5f9c11a1ffdeb9b65c15afaa1cd47dc4c6ef53e5619d82244bc1.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 24399297 -> (known after apply)
      ~ version                     = "18" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/d16313089a42de97c32c76d629ffa4488696b4f57998b2b7e4979ec576fa0165.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "eb7feaf8cf7989ce9b57865817da1b2d-5" -> (known after apply)
      ~ id                            = "gasi-lambda-layers-20250513021721893000000003/builds/d16313089a42de97c32c76d629ffa4488696b4f57998b2b7e4979ec576fa0165.zip" -> (known after apply)
      ~ key                           = "builds/d16313089a42de97c32c76d629ffa4488696b4f57998b2b7e4979ec576fa0165.zip" -> "builds/f42006c0774e5f9c11a1ffdeb9b65c15afaa1cd47dc4c6ef53e5619d82244bc1.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/d16313089a42de97c32c76d629ffa4488696b4f57998b2b7e4979ec576fa0165.zip" -> "builds/f42006c0774e5f9c11a1ffdeb9b65c15afaa1cd47dc4c6ef53e5619d82244bc1.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f42006c0774e5f9c11a1ffdeb9b65c15afaa1cd47dc4c6ef53e5619d82244bc1.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f42006c0774e5f9c11a1ffdeb9b65c15afaa1cd47dc4c6ef53e5619d82244bc1.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1532296686767099696" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/d16313089a42de97c32c76d629ffa4488696b4f57998b2b7e4979ec576fa0165.zip" -> "builds/f42006c0774e5f9c11a1ffdeb9b65c15afaa1cd47dc4c6ef53e5619d82244bc1.zip"
          ~ "timestamp" = "1758300544660400000" -> "1758530299253947000"
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:13" -> (known after apply)
      ~ code_sha256                 = "EZFH0QWHde7CjpycQrv1bHspsvP28jS1F3d+VckLdPA=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-19T08:54:22.086+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:13" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/efd52edf0b92d5c366de2c78a721d135ad86fcd47221358b60ed3213f5a4d53c.zip" -> "builds/791584bab858b15c584199dfbdac3b87a1de7e8b6bc63b2695732a7cb389fb9c.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 120503 -> (known after apply)
      ~ version                     = "13" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/efd52edf0b92d5c366de2c78a721d135ad86fcd47221358b60ed3213f5a4d53c.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "5f206d2f5530a8c35c08c6249866a4c2" -> (known after apply)
      ~ id                            = "gasi-lambda-layers-20250513021721893000000003/builds/efd52edf0b92d5c366de2c78a721d135ad86fcd47221358b60ed3213f5a4d53c.zip" -> (known after apply)
      ~ key                           = "builds/efd52edf0b92d5c366de2c78a721d135ad86fcd47221358b60ed3213f5a4d53c.zip" -> "builds/791584bab858b15c584199dfbdac3b87a1de7e8b6bc63b2695732a7cb389fb9c.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/efd52edf0b92d5c366de2c78a721d135ad86fcd47221358b60ed3213f5a4d53c.zip" -> "builds/791584bab858b15c584199dfbdac3b87a1de7e8b6bc63b2695732a7cb389fb9c.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/791584bab858b15c584199dfbdac3b87a1de7e8b6bc63b2695732a7cb389fb9c.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/791584bab858b15c584199dfbdac3b87a1de7e8b6bc63b2695732a7cb389fb9c.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8095243522211856291" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/efd52edf0b92d5c366de2c78a721d135ad86fcd47221358b60ed3213f5a4d53c.zip" -> "builds/791584bab858b15c584199dfbdac3b87a1de7e8b6bc63b2695732a7cb389fb9c.zip"
          ~ "timestamp" = "1758271880576734000" -> "1758530288344405000"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7443425981321335455" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271880748963200" -> "1758530288441030000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:c1593d2387df58f1a63a81034ff867661c506903f0c962c3a644ac5cfcfd585d460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:c1593d2387df58f1a63a81034ff867661c506903f0c962c3a644ac5cfcfd585d" -> (known after apply)
        name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ repo_digest  = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:2e870624c12942f59da176565649dff0771a7c844e9d6366660ea3dfaac7475d" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "8d9bb67bf0af67580cc21339b887fecb0ac3df57" -> "90e19a20ac34fbc921f033bd4e95acc6a28c4d10"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {} -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/pluginConsequence" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:2e870624c12942f59da176565649dff0771a7c844e9d6366660ea3dfaac7475d" -> (known after apply)
        name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:2e870624c12942f59da176565649dff0771a7c844e9d6366660ea3dfaac7475d" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "8d9bb67bf0af67580cc21339b887fecb0ac3df57" -> "90e19a20ac34fbc921f033bd4e95acc6a28c4d10"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "df60e7cfa292bfd4146e8dc7f8d2199daf134932"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "svep/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this will be created
  + resource "docker_registry_image" "this" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = false
      + name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      + sha256_digest        = (known after apply)
      + triggers             = {
          + "dir_sha" = "df60e7cfa292bfd4146e8dc7f8d2199daf134932"
        }
    }

  # module.svep[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7110894866038901632" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271893317603200" -> "1758530301158052000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchSubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5783076363146881022" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271892853440000" -> "1758530300669728000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8776477025116576273" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271892970360000" -> "1758530300870956800"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concat"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concat.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1305238607303068675" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271893335870000" -> "1758530300982894000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5744949802886506132" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271892160059000" -> "1758530300855130000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4187211414233657458" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271893144892000" -> "1758530301781722000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-createPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-createPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-createPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9083036118846260768" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271892719839000" -> "1758530300721759000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-deleteClinicalWorkflow"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9016832155888039452" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271893152388000" -> "1758530301421231000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-formatOutput.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/f7bde458d929736fc67b2c8a00111db88f3d38a3ca4f3dd64386778f1fbc0cd4.zip" -> "builds/7cf2c9a9261a5eb21db63e3e675c168db0b0fa14631b71e2c54ca3a627723127.zip"
        id                             = "svep-backend-formatOutput"
      ~ last_modified                  = "2025-09-19T16:52:41.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/formatOutput",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7cf2c9a9261a5eb21db63e3e675c168db0b0fa14631b71e2c54ca3a627723127.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7cf2c9a9261a5eb21db63e3e675c168db0b0fa14631b71e2c54ca3a627723127.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-formatOutput.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6911682400612647989" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f7bde458d929736fc67b2c8a00111db88f3d38a3ca4f3dd64386778f1fbc0cd4.zip" -> "builds/7cf2c9a9261a5eb21db63e3e675c168db0b0fa14631b71e2c54ca3a627723127.zip"
          ~ "timestamp" = "1758271893370558000" -> "1758530301737268000"
        }
    }

  # module.svep[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "499931532238631861" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271892051911200" -> "1758530301955587000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-initQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-initQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5843619464522501663" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271891921053800" -> "1758530301670091000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginClinvar"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8198670011394428224" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271892125703000" -> "1758530301375087000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:2e870624c12942f59da176565649dff0771a7c844e9d6366660ea3dfaac7475d" -> (known after apply)
      ~ last_modified                  = "2025-09-19T16:53:29.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2155401767589435447" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271893451602000" -> "1758530300859849000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomadConstraint"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8725264120145045534" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271891982114000" -> "1758530300581716000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/78e149a0638f52eac17857b9cb7649884b3d49691eeff8e418ec9bd37f72a2ab.zip" -> "builds/193a9bfe87fa3939610815fad5de195160975703e992cfc5e68a09e6df687272.zip"
        id                             = "svep-backend-pluginGnomadOneKG"
      ~ last_modified                  = "2025-09-19T16:51:57.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/pluginGnomadOneKG",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/193a9bfe87fa3939610815fad5de195160975703e992cfc5e68a09e6df687272.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/193a9bfe87fa3939610815fad5de195160975703e992cfc5e68a09e6df687272.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5013791133112545410" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/78e149a0638f52eac17857b9cb7649884b3d49691eeff8e418ec9bd37f72a2ab.zip" -> "builds/193a9bfe87fa3939610815fad5de195160975703e992cfc5e68a09e6df687272.zip"
          ~ "timestamp" = "1758271891670232000" -> "1758530301516735000"
        }
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:f664354ef9b82ad70f4d5a6d7b8ede81507f68d25a2a7b2bd2d4048d9872bafb" -> (known after apply)
      ~ last_modified                  = "2025-09-19T08:54:23.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcNotes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4921695003477660709" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271893046864000" -> "1758530302028117800"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryGTF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryGTF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6691557928227859450" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271892225840000" -> "1758530301344569000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5277614986255181568" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271892341806000" -> "1758530301658165000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCFsubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2464567453318195235" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271892723178000" -> "1758530302060111000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4132031801091387395" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271891944106200" -> "1758530301551979000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4278654893804998341" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271893271648000" -> "1758530301333548000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20" -> (known after apply)
      ~ code_sha256                 = "f2PWzFVexG+IlIO8R/nXiHzaOKRsVbNSYstmeebnbPo=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-19T08:54:24.199+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:20" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/5fdcf734153bc67c3afa7b8793c3ebe2274013e5c02af5625b99d38e08680d03.zip" -> "builds/52ab2fda6cb6a25bcd2ab9db8796973464c12ab3c80dcd92aea5a1a275f81b7f.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 37627 -> (known after apply)
      ~ version                     = "20" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::svep-backend-layers-20250815040234005900000003/builds/5fdcf734153bc67c3afa7b8793c3ebe2274013e5c02af5625b99d38e08680d03.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "fe9aa769de6f5eb28a336beee4035a56" -> (known after apply)
      ~ id                            = "svep-backend-layers-20250815040234005900000003/builds/5fdcf734153bc67c3afa7b8793c3ebe2274013e5c02af5625b99d38e08680d03.zip" -> (known after apply)
      ~ key                           = "builds/5fdcf734153bc67c3afa7b8793c3ebe2274013e5c02af5625b99d38e08680d03.zip" -> "builds/52ab2fda6cb6a25bcd2ab9db8796973464c12ab3c80dcd92aea5a1a275f81b7f.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/5fdcf734153bc67c3afa7b8793c3ebe2274013e5c02af5625b99d38e08680d03.zip" -> "builds/52ab2fda6cb6a25bcd2ab9db8796973464c12ab3c80dcd92aea5a1a275f81b7f.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/52ab2fda6cb6a25bcd2ab9db8796973464c12ab3c80dcd92aea5a1a275f81b7f.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/52ab2fda6cb6a25bcd2ab9db8796973464c12ab3c80dcd92aea5a1a275f81b7f.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7176301773733172919" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/5fdcf734153bc67c3afa7b8793c3ebe2274013e5c02af5625b99d38e08680d03.zip" -> "builds/52ab2fda6cb6a25bcd2ab9db8796973464c12ab3c80dcd92aea5a1a275f81b7f.zip"
          ~ "timestamp" = "1758271891667568000" -> "1758530300736275000"
        }
    }

Plan: 81 to add, 48 to change, 64 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: uat03-plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "uat03-plan.out"
✅ Terraform plan created successfully: uat03-plan.out
ℹ️  Plan summary:

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:93ca818b17905fe2d08787926783434784d2f98396b39c1ba84b6cb3b205c81b460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      - image_id     = "sha256:93ca818b17905fe2d08787926783434784d2f98396b39c1ba84b6cb3b205c81b" -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this has been deleted
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:c299a63cd84b5175e22b6a45395d0e8e7a51257e055fca0115d981df1cbdc46e" -> null
      - name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
ℹ️  Cleaning up sensitive files and configurations
ℹ️  Removing temporary files: *.out
✅ Cleanup completed
✅ ============================================================
✅ Atlantis plan completed successfully for uat03!

Thank you for using Atlantis Schema Deploy
© September, 2025 GXC Consortium
✅ Main execution completed successfully
ℹ️  ============================================================
ℹ️  SCRIPT EXECUTION SUMMARY
ℹ️  ============================================================
ℹ️  Environment: uat03
ℹ️  Operation: plan
ℹ️  Exit Code: 0
ℹ️  Duration: 1189s
ℹ️  Timestamp: 2025-09-22T08:41:17Z
✅ Deployment completed successfully! 🎉
ℹ️  Cleaning up sensitive files and configurations
✅ Cleanup completed
✅ Script completed successfully
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gxc-uat03
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-gxc.xapiens.id/lock?id=GSI-Xapiens-CSIRO%252FBGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gxc-uat03
  ```

**Note: Objects have changed outside of Terraform**
Plan: 81 to add, 48 to change, 64 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```